Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
G"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-updateFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1228683169" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742780898785767000" -> "1746431419488441000"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.python_libraries_layer.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.data.external.archive_prepare[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "archive_prepare" {
      + id      = (known after apply)
      + program = [
          + "python3",
          + ".terraform/modules/sbeacon.python_libraries_layer/package.py",
          + "prepare",
        ]
      + query   = {
          + "artifacts_dir"            = "builds"
          + "docker"                   = null
          + "hash_extra"               = null
          + "hash_extra_paths"         = jsonencode([])
          + "paths"                    = jsonencode(
                {
                  + cwd    = "/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/156/default"
                  + module = ".terraform/modules/sbeacon.python_libraries_layer"
                  + root   = "."
                }
            )
          + "recreate_missing_package" = "true"
          + "runtime"                  = null
          + "source_path"              = "\"sbeacon/layers/python_libraries/\""
        }
      + result  = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:31" -> (known after apply)
      ~ code_sha256                 = "StBe5DcwKBR+0axdNAczyUBLUlFzNyN1YOz3IEG20Bo=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-04-22T07:37:46.082+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer:31" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:209479276142:layer:sbeacon_backend_python_libraries_layer" -> (known after apply)
      ~ s3_key                      = "builds/ddd08d65835ecfb867677059d3c31993c294a97bd991a4dd67e48cc549ac249d.zip" -> (known after apply) # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply) # forces replacement
      ~ source_code_size            = 23699724 -> (known after apply)
      ~ version                     = "31" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::gaspi-lambda-layers-20250114060855521800000001/builds/ddd08d65835ecfb867677059d3c31993c294a97bd991a4dd67e48cc549ac249d.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "binary/octet-stream" -> (known after apply)
      ~ etag                          = "137be3af6af0dc29dd46d3737f5d61cd-5" -> (known after apply)
      ~ id                            = "builds/ddd08d65835ecfb867677059d3c31993c294a97bd991a4dd67e48cc549ac249d.zip" -> (known after apply)
      ~ key                           = "builds/ddd08d65835ecfb867677059d3c31993c294a97bd991a4dd67e48cc549ac249d.zip" -> (known after apply) # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/ddd08d65835ecfb867677059d3c31993c294a97bd991a4dd67e48cc549ac249d.zip" -> (known after apply)
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = (known after apply)
      + id                   = (known after apply)
    }

  # module.sbeacon.module.python_libraries_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "478591428" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/ddd08d65835ecfb867677059d3c31993c294a97bd991a4dd67e48cc549ac249d.zip" -> (known after apply)
          ~ "timestamp" = "1745307259032230000" -> (known after apply)
        }
    }

  # module.sbeacon.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "683044983" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1742780899732176000" -> "1746431426196323000"
            # (1 unchanged element hidden)
        }
    }

  # module.security.module.lambda-sendSecurityAlert.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/80d515419abf0e3adc6540bd2b55f9e5cba51c99bde78ac363cc6958664835a4.zip" -> "builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.zip"
        id                             = "security-sendSecurityAlert"
      ~ last_modified                  = "2025-03-12T03:59:00.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "security-infrastructure"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.security.module.lambda-sendSecurityAlert.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "security/lambda/sendSecurityAlert",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.plan.json"
      + id                   = (known after apply)
    }

  # module.security.module.lambda-sendSecurityAlert.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1200695035" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/80d515419abf0e3adc6540bd2b55f9e5cba51c99bde78ac363cc6958664835a4.zip" -> "builds/a5192d6c6931daa312a9d5196c8dd48db9f131a2a75a71add835dc60c9c5671f.zip"
          ~ "timestamp" = "1740987235186741200" -> "1746431420573254200"
        }
    }

  # module.svep.module.docker_image_pluginConsequence_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:37d01f1e71be2226fdf2efc0c904155724b18137385df231aee941a4937943db209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:37d01f1e71be2226fdf2efc0c904155724b18137385df231aee941a4937943db" -> (known after apply)
        name         = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      + repo_digest  = (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "716b10a05b2379d44cc21d5f1788474a5c9e10c7" -> "0b6cce78e4a229bf64bdfed40d8bcdf3db8360d7"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {} -> null
          - cache_from      = [] -> null
          - context         = "svep/lambda/pluginConsequence" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (10 unchanged attributes hidden)
        }
      + build {
          + cache_from     = []
          + context        = "svep/lambda/pluginConsequence"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (10 unchanged attributes hidden)
        }
    }

  # module.svep.module.docker_image_pluginConsequence_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:ea986419475b137c682fcadb8be10192742e8ba426d13d4721304b12a78190c9" -> (known after apply)
        name                 = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers"
      ~ sha256_digest        = "sha256:ea986419475b137c682fcadb8be10192742e8ba426d13d4721304b12a78190c9" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "716b10a05b2379d44cc21d5f1788474a5c9e10c7" -> "0b6cce78e4a229bf64bdfed40d8bcdf3db8360d7"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep.module.docker_image_qcFigures_lambda.docker_image.this must be replaced
+/- resource "docker_image" "this" {
      ~ id           = "sha256:1ec817fd533d48fea9dafb109b8b6069f8773ac4839d99291aec904139689e77209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> (known after apply)
      ~ image_id     = "sha256:1ec817fd533d48fea9dafb109b8b6069f8773ac4839d99291aec904139689e77" -> (known after apply)
        name         = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      + repo_digest  = (known after apply)
      ~ triggers     = { # forces replacement
          ~ "dir_sha" = "54f9f402b2db83ac769d7b1c477b86e2460b89f2" -> "8ec6b63212f2459e9191bb4970d693521777a29c"
        }
        # (2 unchanged attributes hidden)

      - build {
          - build_args      = {
              - "SHARED_LAYER_PATH" = "svep/shared_resources/python-modules/python/shared"
            } -> null
          - cache_from      = [] -> null
          - context         = "svep/lambda/qcFigures" -> null
          - cpu_period      = 0 -> null
          - cpu_quota       = 0 -> null
          - cpu_shares      = 0 -> null
          - dockerfile      = "Dockerfile" -> null
          - extra_hosts     = [] -> null
          - force_remove    = false -> null
          - label           = {} -> null
          - labels          = {} -> null
          - memory          = 0 -> null
          - memory_swap     = 0 -> null
          - no_cache        = false -> null
          - platform        = "linux/amd64" -> null
          - pull_parent     = false -> null
          - remove          = true -> null
          - security_opt    = [] -> null
          - shm_size        = 0 -> null
          - squash          = false -> null
          - suppress_output = false -> null
          - tag             = [] -> null
            # (10 unchanged attributes hidden)
        }
      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "svep/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "svep/lambda/qcFigures"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (10 unchanged attributes hidden)
        }
    }

  # module.svep.module.docker_image_qcFigures_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:c19845c4fe7e468d27b5f90338c7f5a79310e499dc7b3ae4e9505f8653cacbb9" -> (known after apply)
        name                 = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      ~ sha256_digest        = "sha256:c19845c4fe7e468d27b5f90338c7f5a79310e499dc7b3ae4e9505f8653cacbb9" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "54f9f402b2db83ac769d7b1c477b86e2460b89f2" -> "8ec6b63212f2459e9191bb4970d693521777a29c"
        }
        # (2 unchanged attributes hidden)
    }

  # module.svep.module.lambda-clearTempAndRegions.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "346532814" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1744685105752106000" -> "1746431423475923000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep.module.lambda-concat.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-concat/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/85b3fd3c5958b1f4280cc1b75a4ed736a826fd0f7e6a173587b3c13d452e5ca3.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/156/default/svep/lambda/concat'"
          + "filename_new"   = "builds/85b3fd3c5958b1f4280cc1b75a4ed736a826fd0f7e6a173587b3c13d452e5ca3.zip"
          + "filename_old"   = "builds/85b3fd3c5958b1f4280cc1b75a4ed736a826fd0f7e6a173587b3c13d452e5ca3.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-concat"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-concat.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
      ~ filename                       = ".terraform/modules/svep.lambda-concat/builds/4ef180534193f1824fc49c2def0d5b20fb4be346c182d9949be9428e7a1039aa.zip" -> (known after apply)
        id                             = "svep-backend-concat"
      ~ last_modified                  = "2025-04-30T04:12:24.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_python_modules_layer:56",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "STAGING"
            "NAME"        = "svep-backend"
            "Owner"       = "GXC"
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep.module.lambda-concat.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "964488662" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/4ef180534193f1824fc49c2def0d5b20fb4be346c182d9949be9428e7a1039aa.zip" -> "builds/85b3fd3c5958b1f4280cc1b75a4ed736a826fd0f7e6a173587b3c13d452e5ca3.zip"
        }
    }

  # module.svep.module.lambda-concatPages.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-concatPages/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/4a89859d3ac26ed01ce68106ac473d8f64a03f1d9f1a39746c89dec5c812c300.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/156/default/svep/lambda/concatPages'"
          + "filename_new"   = "builds/4a89859d3ac26ed01ce68106ac473d8f64a03f1d9f1a39746c89dec5c812c300.zip"
          + "filename_old"   = "builds/4a89859d3ac26ed01ce68106ac473d8f64a03f1d9f1a39746c89dec5c812c300.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-concatPages"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-concatPages.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
      ~ filename                       = ".terraform/modules/svep.lambda-concatPages/builds/774531a4eaa7588ee25a92ab0d0aa8ef64667da1c4fd00f0627d6b36488f8c33.zip" -> (known after apply)
        id                             = "svep-backend-concatPages"
      ~ last_modified                  = "2025-04-30T04:12:19.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_python_modules_layer:56",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "STAGING"
            "NAME"        = "svep-backend"
            "Owner"       = "GXC"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONCATPAGES_SNS_TOPIC_ARN"     = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-concatPages" -> null
                # (7 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep.module.lambda-concatPages.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "659114051" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/774531a4eaa7588ee25a92ab0d0aa8ef64667da1c4fd00f0627d6b36488f8c33.zip" -> "builds/4a89859d3ac26ed01ce68106ac473d8f64a03f1d9f1a39746c89dec5c812c300.zip"
        }
    }

  # module.svep.module.lambda-concatStarter.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-concatStarter/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/b0f4f3a2e7302a2a88a2a662e4f4d880fd674709e707c893b735b1b253a2e588.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/156/default/svep/lambda/concatStarter'"
          + "filename_new"   = "builds/b0f4f3a2e7302a2a88a2a662e4f4d880fd674709e707c893b735b1b253a2e588.zip"
          + "filename_old"   = "builds/b0f4f3a2e7302a2a88a2a662e4f4d880fd674709e707c893b735b1b253a2e588.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-concatStarter"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-concatStarter.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
      ~ filename                       = ".terraform/modules/svep.lambda-concatStarter/builds/9b624094ab369d212f37fa205d53e61db9f5cc04fd5e6de974e4fcba3a05645e.zip" -> (known after apply)
        id                             = "svep-backend-concatStarter"
      ~ last_modified                  = "2025-04-30T04:12:19.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_python_modules_layer:56",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "STAGING"
            "NAME"        = "svep-backend"
            "Owner"       = "GXC"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONCAT_STARTER_SNS_TOPIC_ARN"  = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-concatStarter" -> null
                # (7 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep.module.lambda-concatStarter.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "812167846" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/9b624094ab369d212f37fa205d53e61db9f5cc04fd5e6de974e4fcba3a05645e.zip" -> "builds/b0f4f3a2e7302a2a88a2a662e4f4d880fd674709e707c893b735b1b253a2e588.zip"
        }
    }

  # module.svep.module.lambda-createPages.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-createPages/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/1e3aabbc38a08c248e7751377c61b4beb9b8f40519c137d67b60d7424f225508.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/156/default/svep/lambda/createPages'"
          + "filename_new"   = "builds/1e3aabbc38a08c248e7751377c61b4beb9b8f40519c137d67b60d7424f225508.zip"
          + "filename_old"   = "builds/1e3aabbc38a08c248e7751377c61b4beb9b8f40519c137d67b60d7424f225508.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-createPages"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-createPages.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
      ~ filename                       = ".terraform/modules/svep.lambda-createPages/builds/e876a862ab2129b1a8ce2ece97c83f7591a96c51f01fdcb3a10cc6ad353a4584.zip" -> (known after apply)
        id                             = "svep-backend-createPages"
      ~ last_modified                  = "2025-04-30T04:12:19.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_python_modules_layer:56",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "STAGING"
            "NAME"        = "svep-backend"
            "Owner"       = "GXC"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CREATEPAGES_SNS_TOPIC_ARN"     = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-createPages" -> null
                # (7 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep.module.lambda-createPages.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "978313043" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/e876a862ab2129b1a8ce2ece97c83f7591a96c51f01fdcb3a10cc6ad353a4584.zip" -> "builds/1e3aabbc38a08c248e7751377c61b4beb9b8f40519c137d67b60d7424f225508.zip"
        }
    }

  # module.svep.module.lambda-deleteClinicalWorkflow.aws_cloudwatch_log_group.lambda[0] will be destroyed
  # (because aws_cloudwatch_log_group.lambda is not in configuration)
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ap-southeast-3:209479276142:log-group:/aws/lambda/svep-backend-deleteClinicalWorkflow" -> null
      - id                = "/aws/lambda/svep-backend-deleteClinicalWorkflow" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/svep-backend-deleteClinicalWorkflow" -> null
      - retention_in_days = 0 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Environment" = "STAGING"
          - "NAME"        = "svep-backend"
          - "Owner"       = "GXC"
        } -> null
      - tags_all          = {
          - "Environment" = "STAGING"
          - "NAME"        = "svep-backend"
          - "Owner"       = "GXC"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.svep.module.lambda-deleteClinicalWorkflow.aws_iam_role.lambda[0] will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::209479276142:role/svep-backend-deleteClinicalWorkflow" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-04-29T09:54:05Z" -> null
      - force_detach_policies = true -> null
      - id                    = "svep-backend-deleteClinicalWorkflow" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "svep-backend-deleteClinicalWorkflow" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Environment" = "STAGING"
          - "NAME"        = "svep-backend"
          - "Owner"       = "GXC"
        } -> null
      - tags_all              = {
          - "Environment" = "STAGING"
          - "NAME"        = "svep-backend"
          - "Owner"       = "GXC"
        } -> null
      - unique_id             = "AROATBRPQCZXL6MG24S2Y" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "svep-backend-deleteClinicalWorkflow-0" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "SNS:Publish"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-sendJobEmail"
                        },
                      - {
                          - Action   = [
                              - "s3:ListBucket",
                              - "s3:GetObject",
                              - "s3:DeleteObject",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:s3:::svep-backend-temp-20250103055724965800000004"
                        },
                      - {
                          - Action   = [
                              - "s3:ListBucket",
                              - "s3:GetObject",
                              - "s3:DeleteObject",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:s3:::svep-backend-temp-20250103055724965800000004/*"
                        },
                      - {
                          - Action   = [
                              - "dynamodb:UpdateItem",
                              - "dynamodb:Scan",
                              - "dynamodb:PutItem",
                              - "dynamodb:GetItem",
                              - "dynamodb:DeleteItem",
                              - "dynamodb:BatchWriteItem",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs"
                        },
                      - {
                          - Action   = "lambda:InvokeFunction"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:lambda:ap-southeast-3:209479276142:function:cognito-sendSvepJobEmail"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "svep-backend-deleteClinicalWorkflow-logs" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:PutLogEvents",
                              - "logs:CreateLogStream",
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:ap-southeast-3:209479276142:log-group:/aws/lambda/svep-backend-deleteClinicalWorkflow:*:*",
                              - "arn:aws:logs:ap-southeast-3:209479276142:log-group:/aws/lambda/svep-backend-deleteClinicalWorkflow:*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.svep.module.lambda-deleteClinicalWorkflow.aws_iam_role_policy.additional_jsons[0] will be destroyed
  # (because aws_iam_role_policy.additional_jsons is not in configuration)
  - resource "aws_iam_role_policy" "additional_jsons" {
      - id          = "svep-backend-deleteClinicalWorkflow:svep-backend-deleteClinicalWorkflow-0" -> null
      - name        = "svep-backend-deleteClinicalWorkflow-0" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "SNS:Publish"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-sendJobEmail"
                    },
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-temp-20250103055724965800000004"
                    },
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-temp-20250103055724965800000004/*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Scan",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-clinic-jobs"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:209479276142:function:cognito-sendSvepJobEmail"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "svep-backend-deleteClinicalWorkflow" -> null
        # (1 unchanged attribute hidden)
    }

  # module.svep.module.lambda-deleteClinicalWorkflow.aws_iam_role_policy.logs[0] will be destroyed
  # (because aws_iam_role_policy.logs is not in configuration)
  - resource "aws_iam_role_policy" "logs" {
      - id          = "svep-backend-deleteClinicalWorkflow:svep-backend-deleteClinicalWorkflow-logs" -> null
      - name        = "svep-backend-deleteClinicalWorkflow-logs" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ap-southeast-3:209479276142:log-group:/aws/lambda/svep-backend-deleteClinicalWorkflow:*:*",
                          - "arn:aws:logs:ap-southeast-3:209479276142:log-group:/aws/lambda/svep-backend-deleteClinicalWorkflow:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "svep-backend-deleteClinicalWorkflow" -> null
        # (1 unchanged attribute hidden)
    }

  # module.svep.module.lambda-deleteClinicalWorkflow.aws_lambda_function.this[0] will be destroyed
  # (because aws_lambda_function.this is not in configuration)
  - resource "aws_lambda_function" "this" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ap-southeast-3:209479276142:function:svep-backend-deleteClinicalWorkflow" -> null
      - code_sha256                    = "ThEdsTinJ81ZWIEwCA5jXIvIH/DlPZe0UOag2CG3dEc=" -> null
      - description                    = "Delete pending after 2 days clinical workflow using cron job." -> null
      - filename                       = "builds/c94a97daf7fde544aadd33e17debe506e4f3b6507ad827bd8282394d7a3accce.zip" -> null
      - function_name                  = "svep-backend-deleteClinicalWorkflow" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "svep-backend-deleteClinicalWorkflow" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:209479276142:function:svep-backend-deleteClinicalWorkflow/invocations" -> null
      - last_modified                  = "2025-04-30T06:37:28.000+0000" -> null
      - layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_binaries_layer:21",
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_python_modules_layer:56",
        ] -> null
      - memory_size                    = 2048 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:209479276142:function:svep-backend-deleteClinicalWorkflow:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:209479276142:function:svep-backend-deleteClinicalWorkflow:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::209479276142:role/svep-backend-deleteClinicalWorkflow" -> null
      - runtime                        = "python3.12" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "Nfsh+wmX4FMFLrpry6+uEvT2EqCRNFj/uW2IJJ9AlBU=" -> null
      - source_code_size               = 1095 -> null
      - tags                           = {
          - "Environment"           = "STAGING"
          - "NAME"                  = "svep-backend"
          - "Owner"                 = "GXC"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - tags_all                       = {
          - "Environment"           = "STAGING"
          - "NAME"                  = "svep-backend"
          - "Owner"                 = "GXC"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - timeout                        = 900 -> null
      - version                        = "$LATEST" -> null
        # (4 unchanged attributes hidden)

      - environment {
          - variables = {
              - "COGNITO_SVEP_JOB_EMAIL_LAMBDA" = "arn:aws:lambda:ap-southeast-3:209479276142:function:cognito-sendSvepJobEmail"
              - "DYNAMO_CLINIC_JOBS_TABLE"      = "sbeacon-dataportal-clinic-jobs"
              - "SEND_JOB_EMAIL_ARN"            = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-sendJobEmail"
              - "SVEP_TEMP"                     = "svep-backend-temp-20250103055724965800000004"
              - "USER_POOL_ID"                  = "ap-southeast-3_TPJOWHZvH"
            } -> null
        }

      - ephemeral_storage {
          - size = 8192 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/svep-backend-deleteClinicalWorkflow" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.svep.module.lambda-deleteClinicalWorkflow.null_resource.archive[0] will be destroyed
  # (because null_resource.archive is not in configuration)
  - resource "null_resource" "archive" {
      - id       = "1936498351" -> null
      - triggers = {
          - "filename"  = "builds/c94a97daf7fde544aadd33e17debe506e4f3b6507ad827bd8282394d7a3accce.zip"
          - "timestamp" = "1745990570290712200"
        } -> null
    }

  # module.svep.module.lambda-formatOutput.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-formatOutput/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/6d6709ccef030a3aff6d4cec16be38f2ff98c5db2d0763b900f17f4012f55481.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/156/default/svep/lambda/formatOutput'"
          + "filename_new"   = "builds/6d6709ccef030a3aff6d4cec16be38f2ff98c5db2d0763b900f17f4012f55481.zip"
          + "filename_old"   = "builds/6d6709ccef030a3aff6d4cec16be38f2ff98c5db2d0763b900f17f4012f55481.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-formatOutput"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-formatOutput.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
      ~ filename                       = ".terraform/modules/svep.lambda-formatOutput/builds/e494bef938167ef6895199d5aa2d39193dd1b2855bb4e11843334ec2c38429d0.zip" -> (known after apply)
        id                             = "svep-backend-formatOutput"
      ~ last_modified                  = "2025-04-30T04:12:19.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_python_modules_layer:56",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "STAGING"
            "NAME"        = "svep-backend"
            "Owner"       = "GXC"
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep.module.lambda-formatOutput.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "129990628" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/e494bef938167ef6895199d5aa2d39193dd1b2855bb4e11843334ec2c38429d0.zip" -> "builds/6d6709ccef030a3aff6d4cec16be38f2ff98c5db2d0763b900f17f4012f55481.zip"
        }
    }

  # module.svep.module.lambda-getResultsURL.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "svep-backend-getResultsURL"
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_python_modules_layer:56",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "STAGING"
            "NAME"        = "svep-backend"
            "Owner"       = "GXC"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep.module.lambda-initQuery.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-initQuery/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/dfd467e6baebceaefb4f01fb6a7e5eee71c6670b859ee047f4330e1c0a2211f1.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/156/default/svep/lambda/initQuery'"
          + "filename_new"   = "builds/dfd467e6baebceaefb4f01fb6a7e5eee71c6670b859ee047f4330e1c0a2211f1.zip"
          + "filename_old"   = "builds/dfd467e6baebceaefb4f01fb6a7e5eee71c6670b859ee047f4330e1c0a2211f1.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-initQuery"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-initQuery.aws_iam_policy.additional[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional" {
        id               = "arn:aws:iam::209479276142:policy/svep-backend-initQuery"
        name             = "svep-backend-initQuery"
      ~ policy           = jsonencode(
          ~ {
              ~ Statement = [
                    # (4 unchanged elements hidden)
                    {
                        Action   = [
                            "dynamodb:UpdateItem",
                            "dynamodb:Scan",
                            "dynamodb:Query",
                            "dynamodb:PutItem",
                            "dynamodb:GetItem",
                            "dynamodb:DescribeTable",
                            "dynamodb:DeleteItem",
                            "dynamodb:BatchWriteItem",
                            "dynamodb:BatchGetItem",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:dynamodb:ap-southeast-3:209479276142:table/sbeacon-dataportal-project-users"
                    },
                  ~ {
                      ~ Action   = [
                            # (1 unchanged element hidden)
                            "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = "lambda:InvokeFunction"
                        Effect   = "Allow"
                        Resource = "arn:aws:lambda:ap-southeast-3:209479276142:function:cognito-sendSvepJobEmail"
                    },
                    # (1 unchanged element hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags             = {}
        # (7 unchanged attributes hidden)
    }

  # module.svep.module.lambda-initQuery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "443642359" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/c0f26c5cf65860b3c2018e61b7c26bb10fe7ae179701fe185a374b092296c570.zip" -> "builds/dfd467e6baebceaefb4f01fb6a7e5eee71c6670b859ee047f4330e1c0a2211f1.zip"
        }
    }

  # module.svep.module.lambda-pluginClinvar.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-pluginClinvar/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/5472d49defdeba35683aa83d44b007a3975a154a8a90e6ce8f10858f69086a85.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/156/default/svep/lambda/pluginClinvar'"
          + "filename_new"   = "builds/5472d49defdeba35683aa83d44b007a3975a154a8a90e6ce8f10858f69086a85.zip"
          + "filename_old"   = "builds/5472d49defdeba35683aa83d44b007a3975a154a8a90e6ce8f10858f69086a85.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-pluginClinvar"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-pluginClinvar.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "952516394" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/7bdda68e0b0f2f9a30fe84ed901be9d289009c979dee78c419d18b242ea4d767.zip" -> "builds/5472d49defdeba35683aa83d44b007a3975a154a8a90e6ce8f10858f69086a85.zip"
        }
    }

  # module.svep.module.lambda-pluginConsequence.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-pluginConsequence"
      ~ image_uri                      = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/svep-pluginconsequence-lambda-containers@sha256:ea986419475b137c682fcadb8be10192742e8ba426d13d4721304b12a78190c9" -> (known after apply)
      ~ last_modified                  = "2025-04-25T11:53:41.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "svep-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "FILTER_CONSEQUENCE_RANK"       = "99"
                # (12 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep.module.lambda-pluginGnomad.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-pluginGnomad/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/c5c4530c749fd16893be04bbfdd4f4cb3837f81af973e86a353836d0e9228706.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/156/default/svep/lambda/pluginGnomad'"
          + "filename_new"   = "builds/c5c4530c749fd16893be04bbfdd4f4cb3837f81af973e86a353836d0e9228706.zip"
          + "filename_old"   = "builds/c5c4530c749fd16893be04bbfdd4f4cb3837f81af973e86a353836d0e9228706.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-pluginGnomad"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-pluginGnomad.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "995313520" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/16b5e002cb6831b38649a881b68694bbc83c1b185e87fcf97f8e91388263f95e.zip" -> "builds/c5c4530c749fd16893be04bbfdd4f4cb3837f81af973e86a353836d0e9228706.zip"
        }
    }

  # module.svep.module.lambda-qcFigures.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "svep-backend-qcFigures"
      ~ image_uri                      = "209479276142.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers@sha256:c19845c4fe7e468d27b5f90338c7f5a79310e499dc7b3ae4e9505f8653cacbb9" -> (known after apply)
      ~ last_modified                  = "2025-05-05T02:39:34.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "STAGING"
            "NAME"                  = "svep-backend"
            "Owner"                 = "GXC"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.svep.module.lambda-queryGTF.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-queryGTF/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/daf52a6059d11849b5d145a20a3a9c02f2a646fb140f995d3ce90ac0480ba0a2.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/156/default/svep/lambda/queryGTF'"
          + "filename_new"   = "builds/daf52a6059d11849b5d145a20a3a9c02f2a646fb140f995d3ce90ac0480ba0a2.zip"
          + "filename_old"   = "builds/daf52a6059d11849b5d145a20a3a9c02f2a646fb140f995d3ce90ac0480ba0a2.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-queryGTF"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-queryGTF.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "301329795" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/8ae523768eee01cc1a438e9f4423d3c8a17507e8178f7873ff1cc53ef4ba7184.zip" -> "builds/daf52a6059d11849b5d145a20a3a9c02f2a646fb140f995d3ce90ac0480ba0a2.zip"
        }
    }

  # module.svep.module.lambda-queryVCF.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-queryVCF/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/a8e3c930f9b79775cc9a9c87e683bca3005a0f42b75ebcf826b70e2b08964a52.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/156/default/svep/lambda/queryVCF'"
          + "filename_new"   = "builds/a8e3c930f9b79775cc9a9c87e683bca3005a0f42b75ebcf826b70e2b08964a52.zip"
          + "filename_old"   = "builds/a8e3c930f9b79775cc9a9c87e683bca3005a0f42b75ebcf826b70e2b08964a52.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-queryVCF"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-queryVCF.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "379440565" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/a34888268593e1ab3d9da72e58e6f64035a0f9fe939287d128569f01bcc161b4.zip" -> "builds/a8e3c930f9b79775cc9a9c87e683bca3005a0f42b75ebcf826b70e2b08964a52.zip"
        }
    }

  # module.svep.module.lambda-queryVCFsubmit.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-queryVCFsubmit/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/95ef8eb492243327a54d8e62a7be0a93cbc30a7031f92b5dbdd893ce4705f5f5.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/156/default/svep/lambda/queryVCFsubmit'"
          + "filename_new"   = "builds/95ef8eb492243327a54d8e62a7be0a93cbc30a7031f92b5dbdd893ce4705f5f5.zip"
          + "filename_old"   = "builds/95ef8eb492243327a54d8e62a7be0a93cbc30a7031f92b5dbdd893ce4705f5f5.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-queryVCFsubmit"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-queryVCFsubmit.aws_lambda_function.lambda[0] will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
      ~ filename                       = ".terraform/modules/svep.lambda-queryVCFsubmit/builds/d529de5cbdd9c12b7d70b95be9e5fa30fb464224cbd37127768f1c97137dd819.zip" -> (known after apply)
        id                             = "svep-backend-queryVCFsubmit"
      ~ last_modified                  = "2025-04-30T04:12:19.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_python_modules_layer:56",
        ] -> (known after apply)
        tags                           = {
            "Environment" = "STAGING"
            "NAME"        = "svep-backend"
            "Owner"       = "GXC"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "QUERY_VCF_SUBMIT_SNS_TOPIC_ARN" = "arn:aws:sns:ap-southeast-3:209479276142:svep-backend-queryVCFsubmit" -> null
                # (6 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.svep.module.lambda-queryVCFsubmit.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1599690118" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/d529de5cbdd9c12b7d70b95be9e5fa30fb464224cbd37127768f1c97137dd819.zip" -> "builds/95ef8eb492243327a54d8e62a7be0a93cbc30a7031f92b5dbdd893ce4705f5f5.zip"
        }
    }

  # module.svep.module.lambda-sendJobEmail.data.external.built[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "external" "built" {
      + id      = (known after apply)
      + program = [
          + "python",
          + ".terraform/modules/svep.lambda-sendJobEmail/built.py",
        ]
      + query   = {
          + "build_command"  = "python build.py 'builds/e3adc49d45d297cacc8d974bb7e104e68d128cd412c4ccaee9839be0e41c2168.zip' 'python3.12' '/home/atlantis/.atlantis/repos/GSI-Xapiens-CSIRO/BGSI-GeneticAnalysisSupportPlatformIndonesia-GASPI/156/default/svep/lambda/sendJobEmail'"
          + "filename_new"   = "builds/e3adc49d45d297cacc8d974bb7e104e68d128cd412c4ccaee9839be0e41c2168.zip"
          + "filename_old"   = "builds/e3adc49d45d297cacc8d974bb7e104e68d128cd412c4ccaee9839be0e41c2168.zip"
          + "module_relpath" = ".terraform/modules/svep.lambda-sendJobEmail"
        }
      + result  = (known after apply)
    }

  # module.svep.module.lambda-sendJobEmail.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "1528302147" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename" = "builds/225ef7dd85825f6b743f92ab563c143c09d1431f9ec5547f58ecf0aa9a43839c.zip" -> "builds/e3adc49d45d297cacc8d974bb7e104e68d128cd412c4ccaee9839be0e41c2168.zip"
        }
    }

  # module.svep.module.lambda-updateReferenceFiles.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "680320269" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1744685105104275000" -> "1746431427319374000"
            # (1 unchanged element hidden)
        }
    }

  # module.svep.module.python_modules_layer.aws_lambda_layer_version.this[0] must be replaced
+/- resource "aws_lambda_layer_version" "this" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_python_modules_layer:56" -> (known after apply)
      ~ code_sha256                 = "G/8dbbfyfRItIlH+1EFI0Q2TKRqYbAYSt7fCVoTAtXI=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-04-30T04:12:13.853+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_python_modules_layer:56" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:209479276142:layer:svep_backend_python_modules_layer" -> (known after apply)
      ~ s3_key                      = "builds/a690ae9533c266a13f3da227b56291e4abac5142791e931b3aa42bb4433f5873.zip" -> "builds/5aad859a7bf34f8096c6879cd1da8e3e1567c0101974a62cbddb2e5d84bb3d2a.zip" # forces replacement
      + s3_object_version           = (known after apply) # forces replacement
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + source_code_hash            = (known after apply)
      ~ source_code_size            = 12029 -> (known after apply)
      ~ version                     = "56" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.svep.module.python_modules_layer.aws_s3_object.lambda_package[0] must be replaced
+/- resource "aws_s3_object" "lambda_package" {
      ~ arn                           = "arn:aws:s3:::svep-backend-layers-20250103055724913100000001/builds/a690ae9533c266a13f3da227b56291e4abac5142791e931b3aa42bb4433f5873.zip" -> (known after apply)
      ~ bucket_key_enabled            = false -> (known after apply)
      + checksum_crc32                = (known after apply)
      + checksum_crc32c               = (known after apply)
      + checksum_crc64nvme            = (known after apply)
      + checksum_sha1                 = (known after apply)
      + checksum_sha256               = (known after apply)
      ~ content_type                  = "application/octet-stream" -> (known after apply)
      ~ etag                          = "281617943bcfc19ad984ae83aba027be" -> (known after apply)
      ~ id                            = "builds/a690ae9533c266a13f3da227b56291e4abac5142791e931b3aa42bb4433f5873.zip" -> (known after apply)
      ~ key                           = "builds/a690ae9533c266a13f3da227b56291e4abac5142791e931b3aa42bb4433f5873.zip" -> "builds/5aad859a7bf34f8096c6879cd1da8e3e1567c0101974a62cbddb2e5d84bb3d2a.zip" # forces replacement
      + kms_key_id                    = (known after apply)
      - metadata                      = {} -> null
      ~ server_side_encryption        = "AES256" -> (known after apply)
      ~ source                        = "builds/a690ae9533c266a13f3da227b56291e4abac5142791e931b3aa42bb4433f5873.zip" -> "builds/5aad859a7bf34f8096c6879cd1da8e3e1567c0101974a62cbddb2e5d84bb3d2a.zip"
      - tags                          = {} -> null
      + version_id                    = (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.svep.module.python_modules_layer.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "svep/shared_resources/python-modules/",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/5aad859a7bf34f8096c6879cd1da8e3e1567c0101974a62cbddb2e5d84bb3d2a.zip"
              + runtime       = ""
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/5aad859a7bf34f8096c6879cd1da8e3e1567c0101974a62cbddb2e5d84bb3d2a.plan.json"
      + id                   = (known after apply)
    }

  # module.svep.module.python_modules_layer.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "633334801" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/a690ae9533c266a13f3da227b56291e4abac5142791e931b3aa42bb4433f5873.zip" -> "builds/5aad859a7bf34f8096c6879cd1da8e3e1567c0101974a62cbddb2e5d84bb3d2a.zip"
          ~ "timestamp" = "1745986103311906000" -> "1746431423391727000"
        }
    }

Plan: 61 to add, 33 to change, 64 to destroy.
╷
│ Warning: Deprecated attribute
│ 
│   on sbeacon/cloudfront.tf line 45, in resource "aws_cloudfront_distribution" "api_distribution":
│   45:     domain_name = split("/", aws_api_gateway_deployment.BeaconApi.invoke_url)[2]
│ 
│ The attribute "invoke_url" is deprecated. Refer to the provider
│ documentation for details.
│ 
│ (and 2 more similar warnings elsewhere)
╵
╷
│ Error: Archive creation error
│ 
│   with module.svep.data.archive_file.binaries_layer,
│   on svep/layers.tf line 3, in data "archive_file" "binaries_layer":
│    3: data "archive_file" "binaries_layer" {
│ 
│ error creating archive: error archiving directory: could not archive
│ missing directory: svep/layers/binaries/
╵


```
</details>